{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Utente\Desktop\UNI\DEMOGRAFIA APPLICATA ALL'IMPRESA E AL MERCATO\progetto\log_progeto_demo_Pietro_Ruffo.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}23 May 2021, 11:49:43
{txt}
{com}. cd "C:\Users\Utente\Desktop\UNI\DEMOGRAFIA APPLICATA ALL'IMPRESA E AL MERCATO\progetto\dataset progetto\INTEG2GEN_2015_IT_STATA\MICRODATI"
{res}C:\Users\Utente\Desktop\UNI\DEMOGRAFIA APPLICATA ALL'IMPRESA E AL MERCATO\progetto\dataset progetto\INTEG2GEN_2015_IT_STATA\MICRODATI
{txt}
{com}. use INTEG2GEN_A2015.dta
{txt}
{com}. 
. set more off
{txt}
{com}. ***CODIFICA VARIABILI***
. 
. *LA TUA STORIA
. 
. *almeno un genitore straniero
. gen almeno_un_gen_str=0
{txt}
{com}. replace almeno_un_gen_str=1 if e2!="1"| e3!="1"
{txt}(35,590 real changes made)

{com}. 
. *tutti e due i gen italiani
. gen gen_ita=0
{txt}
{com}. replace gen_ita=1 if e2=="1" & e3=="1"
{txt}(32,537 real changes made)

{com}. 
. *entrambi i gen stranieri
. gen gen_str=0
{txt}
{com}. replace gen_str=1 if e2!="1"& e3!="1"
{txt}(30,277 real changes made)

{com}. tab gen_str

    {txt}gen_str {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     37,850       55.56       55.56
{txt}          1 {c |}{res}     30,277       44.44      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     68,127      100.00
{txt}
{com}. 
. ***concentriamoci con i ragazzi con  un background migratorio
. drop if gen_ita==1
{txt}(32,537 observations deleted)

{com}. *scuola superiore
. gen scuola_sup=0
{txt}
{com}. replace scuola_sup=1 if tiposcuola=="2"
{txt}(18,721 real changes made)

{com}. ****concencentriamoci solo sui ragazz delle superiori
. drop if scuola_sup==0
{txt}(16,869 observations deleted)

{com}. 
. *sesso
. gen donna=0
{txt}
{com}. replace donna=1 if a1=="2"
{txt}(9,809 real changes made)

{com}. *cittadinanza (1 se cittadino 0 altrimenti)
. gen cittadinanza=0
{txt}
{com}. replace cittadinanza=1 if cittad=="1"
{txt}(2,353 real changes made)

{com}. *nat* in italia
. gen nato_ita=0
{txt}
{com}. replace nato_ita=1 if a3=="1"
{txt}(5,266 real changes made)

{com}. *ti senti italiano o straniero
. gen sentirsi_ita=0
{txt}
{com}. replace sentirsi_ita=1 if a11=="1"
{txt}(5,682 real changes made)

{com}. *in futuro restare in italia
. gen futuro_in_ita=0
{txt}
{com}. replace futuro_in_ita=1 if a10_b_1=="1"| a10_a_1=="1"
{txt}(5,457 real changes made)

{com}. 
. *CONOSCENZA ED USO DELLA LINGUA ITALIANA
. 
. *focalizziamoci sulle competenze attive della lingua, che presuppongono un dominio delle passive (capire, leggere)
. *parlare italiano bene
. gen parlarebene=0
{txt}
{com}. replace parlarebene=1 if b1_2=="4"| b1_2=="5"
{txt}(15,162 real changes made)

{com}. *scrivere italiano bene
. gen scriverebene=0
{txt}
{com}. replace scriverebene=1 if b1_4=="4"| b1_4=="5"
{txt}(14,159 real changes made)

{com}. *pensa in italiano
. gen pensa_ita=0
{txt}
{com}. replace pensa_ita=1 if b3_1b=="1"
{txt}(10,568 real changes made)

{com}. 
. *LA SCUOLA, GLI INSEGNANTI E I COMPAGNI
. 
. *rendimento scolastico percepito
. gen rend_perc_male=0
{txt}
{com}. replace rend_perc_male=1 if c8=="4"
{txt}(1,389 real changes made)

{com}. *proxy rendimento effettivo, droppo i missing perché alcuni non hanno ancora la pagella
. *matematica
. drop if c9_a=="99"
{txt}(566 observations deleted)

{com}. gen mate_insuf=0
{txt}
{com}. replace mate_insuf=1 if c9_a<="05"
{txt}(3,379 real changes made)

{com}. *italiano
. drop if c9_b=="99"
{txt}(42 observations deleted)

{com}. gen ita_male=0
{txt}
{com}. replace ita_male=1 if c9_b<="05"
{txt}(5,790 real changes made)

{com}. *bocciato almeno una volta
. gen bocciato=0
{txt}
{com}. replace bocciato=1 if c10!="1"
{txt}(5,464 real changes made)

{com}. *aiuto compiti a casa
. gen aiuto_compiti=0
{txt}
{com}. replace aiuto_compiti=1 if c11_a_1!="1"
{txt}(3,154 real changes made)

{com}. *esce con compagni
. gen esce_con_compagni=0
{txt}
{com}. replace esce_con_compagni=1 if c13=="2"
{txt}(13,789 real changes made)

{com}. *lavoretti
. gen lavoretti_frequenti=0
{txt}
{com}. replace lavoretti_frequenti=1 if c21=="1"|c21=="2"
{txt}(3,343 real changes made)

{com}. *pensa che solo ricchi e raccomandati vanno avanti
. gen crede_raccomandati=0
{txt}
{com}. replace crede_raccomandati=1 if c22_5=="5"
{txt}(6,632 real changes made)

{com}. *intenzioni post scuola superiore, solo per ragazzi delle superiori
. *lavorare
. gen lavorare=0
{txt}
{com}. replace lavorare=1 if (c19_a_1=="1" | c19_a_1=="2") 
{txt}(7,428 real changes made)

{com}. *studiare, includo anche quelli che hanno risposto altro perché comunque faranno qualcosa e la modalità "Proseguire gli studi all'università" è la più numerosa
. gen studiare=0
{txt}
{com}. replace studiare=1 if (c19_a_1=="3"| c19_a_1=="6")
{txt}(8,815 real changes made)

{com}. *NEET, includo anche gli indecisi
. gen neet_risk=0
{txt}
{com}. replace neet_risk=1 if (c19_a_1=="4"| c19_a_1=="5") 
{txt}(1,870 real changes made)

{com}. *iniziato le scuole tardi: tra la prima media e il quinto superiore
. gen inizio_scuola_tardi=0
{txt}
{com}. replace inizio_scuola_tardi=1 if c6>="07" & c6<="14" 
{txt}(3,853 real changes made)

{com}. 
. *IL TEMPO LIBERO E GLI AMICI
. 
. *bullismo, almeno una volta
. gen bullying=0
{txt}
{com}. replace bullying=1 if d9_2!="5"|d9_13!="5"| d9_14!="5"| d9_9!="5"| d9_10!="5"| d9_5!="5"| d9_6!="5"| d9_1!="5"| d9_3!="5"| d9_4!="5"| d9_7!="5"| d9_8!="5"| d9_11!="5"| d9_12!="5"
{txt}(12,895 real changes made)

{com}. *bullismo, tutti i giorni
. gen bullying_everyday=0
{txt}
{com}. replace bullying_everyday=1 if d9_2=="1"|d9_13=="1"| d9_14=="1"| d9_9=="1"| d9_10=="1"| d9_5=="1"| d9_6=="1"| d9_1=="1"| d9_3=="1"| d9_4=="1"| d9_7=="1"| d9_8=="1"| d9_11=="1"| d9_12=="1"
{txt}(1,534 real changes made)

{com}. *bullissmo, spesso
. gen bullying_often=0
{txt}
{com}. replace bullying_often=1 if (d9_2!="5" & d9_2!="1")|(d9_13!="5" & d9_13!="1")|( d9_14!="5" &  d9_14!="1")|(d9_9!="5" & d9_9!="1")|(d9_10!="5" & d9_10!="1")|(d9_5!="5" & d9_5!="1")|(d9_6!="5"& d9_6!="1")|(d9_1!="5" & d9_1!="1")|(d9_3!="5" & d9_3!="1")| ( d9_4!="5" &  d9_4!="1")|( d9_7!="5" &  d9_7!="1")| (d9_8!="5" & d9_8!="1")|(d9_11!="5" & d9_11!="1")|(d9_12!="5" & d9_12!="1")
{txt}(12,727 real changes made)

{com}. *uso molto internet: navigare in internet più di 2 ore al giorno oppure usa internet tutti i giorni per svolgere le attività elencate nel questionario alla domanda D.8
. gen uso_molto_internet=0
{txt}
{com}. replace uso_molto_internet=1 if d5_1=="5"| d8_3=="1"| d8_4=="1"| d8_9=="1"| d8_8=="1"| d8_7=="1"| d8_5=="1"| d8_2=="1"| d8_1=="1"| d8_6=="1"
{txt}(16,370 real changes made)

{com}. *sport
. gen sport=0
{txt}
{com}. replace sport=1 if d6=="2"
{txt}(8,642 real changes made)

{com}. *amici italiani: i compagni di scuola che incontra fuori dall'orario scolastico e gli amici sono italiani oppure italiani e stranieri (solo per ragazzi con cittadinanza) oppure 
. *le var contrassegnate dalla lettera c sono per i compagni di scuola (una per i ragazz* con cittadinanza e una senza) mentre quelle contrassegnate dalla d fanno riferimento agli amici al di fuori della scuola 
. gen amici_italiani=0
{txt}
{com}. replace amici_italiani=1 if c13_a_1=="1"| c13_b!="2"|d2_a=="1"|d2_a=="3"|d2_1=="1"
{txt}(18,093 real changes made)

{com}. *esce poco o nulla: vede gli amici meno di 4 volte al mese, poche volte l'anno oppure mai
. gen esce_poco=0
{txt}
{com}. replace esce_poco=1 if d1>="4"
{txt}(2,503 real changes made)

{com}. 
. *I TUOI GENITORI E LA TUA FAMIGLIA
. *influenza dei genitori sulle amicizie
. gen infl_gen_amicizie=0
{txt}
{com}. replace infl_gen_amicizie=1 if d4!="1"
{txt}(6,835 real changes made)

{com}. *vive con entrambi i genitori
. gen vive_con_gen=0
{txt}
{com}. replace vive_con_gen=1 if e1_a=="2" & e1_b=="2"
{txt}(12,957 real changes made)

{com}. *vive solo con la madre
. gen vive_solo_con_madre=0
{txt}
{com}. replace vive_solo_con_madre=1 if e1_b=="2" & e1_a=="1" & e1_c=="1" & e1_f=="1" & e1_g=="1" & e1_h=="1" & e1_e=="1"
{txt}(800 real changes made)

{com}. *fratelli/sorelle
. gen frat_sor=0
{txt}
{com}. replace frat_sor=1 if e1_e=="2" | e5=="2"
{txt}(14,743 real changes made)

{com}. *almeno un genitore lavora
. gen gen_lav=0
{txt}
{com}. replace gen_lav=1 if e2_g=="2" |e3_g=="2"
{txt}(17,080 real changes made)

{com}. *istruzione bassa madre
. gen istr_bassa_mad=0
{txt}
{com}. replace istr_bassa_mad=1 if e2_i <="3" | e2_i=="6"
{txt}(8,043 real changes made)

{com}. *istruzione bassa padre
. gen istr_bassa_pad=0
{txt}
{com}. replace istr_bassa_pad=1 if e3_i <="3" | e3_i=="6"
{txt}(8,943 real changes made)

{com}. *confronto con famiglia: se ha maturato la scelta di iscriversi in quella scuola superiore ascoltando la famiglia oppure se i genitori o i parenti hanno hanno influito molto sulla scelta (da 1 a 3 su una scala da 1 a 10 dove 1 è molto e 10  è per nulla)
. gen confronto_con_famiglia=0
{txt}
{com}. replace confronto_con_famiglia=1 if c2_a=="3"|c2_b_1<="03"|c2_b_2<="03"
{txt}(16,110 real changes made)

{com}. 
. *LA CASA E LA ZONA IN CUI VIVI
. 
. *pendolarismo, più di 30 min
. gen scuola_lontana=0
{txt}
{com}. replace scuola_lontana=1 if f11!="1" & f11!="2"
{txt}(5,875 real changes made)

{com}. *ha una camera propria
. gen cameretta=0
{txt}
{com}. replace cameretta=1 if f4=="4"
{txt}(9,573 real changes made)

{com}. *povertà estrema: senza gabinetto o senza acqua calda o senza doccia o senza riscaldamento
. gen extr_pov=0
{txt}
{com}. replace extr_pov=1 if f2_2=="1" | f2_3=="1" | f2_4=="1" | f2_6=="1"
{txt}(1,264 real changes made)

{com}. *la famiglia possiede un pc
. gen pc=0
{txt}
{com}. replace pc=1 if f6_4=="2"
{txt}(16,520 real changes made)

{com}. *vive in zona periferica (piccolo comune)
. gen rural=0
{txt}
{com}. replace rural=1 if grande_com=="0"
{txt}(12,502 real changes made)

{com}. 
. ***GRAFICI***
. *per realizzare i grafici sono state create le seguenti variabili
. *nato in
. gen nato_in=0
{txt}
{com}. replace nato_in=1  if a4=="201"
{txt}(1,871 real changes made)

{com}. replace nato_in=2  if a4=="235"
{txt}(3,241 real changes made)

{com}. replace nato_in=3  if a4=="254"
{txt}(910 real changes made)

{com}. replace nato_in=4  if a4=="436"
{txt}(882 real changes made)

{com}. replace nato_in=8  if a4=="243"
{txt}(669 real changes made)

{com}. 
. *intenzioni
. gen intenzioni=0
{txt}
{com}. replace intenzioni=1 if (c19_a_1=="1" | c19_a_1=="2")
{txt}(7,428 real changes made)

{com}. replace intenzioni=2 if (c19_a_1=="3"| c19_a_1=="6")
{txt}(8,815 real changes made)

{com}. replace intenzioni=3 if (c19_a_1=="4"| c19_a_1=="5") 
{txt}(1,870 real changes made)

{com}. 
. 
. ***MODELLI LOGIT***
. 
. ***MODELLI CON VAR RELATIVE ALLA SEZIONE "LA TUA STORIA"
. 
. *var altamente dipendenti tra loro, tengo solo cittadinanza
. tab cittadinanza sentirsi_ita, chi2

{txt}cittadinan {c |}     sentirsi_ita
        za {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}    10,291      5,546 {txt}{c |}{res}    15,837 
{txt}         1 {c |}{res}     2,276          0 {txt}{c |}{res}     2,276 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}    12,567      5,546 {txt}{c |}{res}    18,113 

{txt}          Pearson chi2({res}1{txt}) = {res} 1.1e+03  {txt} Pr = {res}0.000
{txt}
{com}. tab cittadinanza futuro_in_ita, chi2 

{txt}cittadinan {c |}     futuro_in_ita
        za {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}    11,390      4,447 {txt}{c |}{res}    15,837 
{txt}         1 {c |}{res}     1,455        821 {txt}{c |}{res}     2,276 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}    12,845      5,268 {txt}{c |}{res}    18,113 

{txt}          Pearson chi2({res}1{txt}) = {res} 61.6301  {txt} Pr = {res}0.000
{txt}
{com}. 
. *bullizzato almeno una volta
. quietly logit studiare bullying donna, or r
{txt}
{com}. quietly logit studiare bullying donna cittadinanza, or r
{txt}
{com}. quietly logit studiare bullying donna cittadinanza nato_ita, or r
{txt}
{com}. estimates store mod1
{txt}
{com}. 
. *bullizzato spesso
. quietly logit studiare bullying_often donna, or r
{txt}
{com}. quietly logit studiare bullying_often donna cittadinanza, or r
{txt}
{com}. quietly logit studiare bullying_often donna cittadinanza nato_ita, or r
{txt}
{com}. estimates store mod2
{txt}
{com}. 
. *bullizzato sempre
. quietly logit studiare bullying_everyday donna, or r
{txt}
{com}. quietly logit studiare bullying_everyday donna cittadinanza, or r
{txt}
{com}. quietly logit studiare bullying_everyday donna cittadinanza nato_ita, or r
{txt}
{com}. estimates store mod3
{txt}
{com}. 
. label var studiare "Iscriversi all'università"
{txt}
{com}. label var donna "Essere donna"
{txt}
{com}. label var cittadinanza "Avere la cittadinanza italiana"
{txt}
{com}. label var nato_ita "Essere nati in Italia"
{txt}
{com}. label var bullying "Bullizzati almeno una volta"
{txt}
{com}. label var bullying_often "Bullizzati spesso"
{txt}
{com}. label var bullying_everyday  "Bullizzati sempre"
{txt}
{com}. 
. esttab mod1 mod2 mod3,b(%9.3f) se(%9.3f) eform pr2 label nogaps order() star(+ 0.10 * 0.05 ** 0.01 *** 0.001) title("Essere vittime di bullismo e iscriversi all'università. Modelli Logit con variabili relative al vissuto degli studenti. 1=Bullizzati almeno una volta; 2=Bullizzati spesso; 3=Bullizzati sempre")
{res}
{txt}Essere vittime di bullismo e iscriversi all'università. Modelli Logit con variabili relative al vissuto degli studenti. 1=Bullizzati almeno una volta; 2=Bullizzati spesso; 3=Bullizzati sempre
{txt}{hline 68}
{txt}                              (1)             (2)             (3)   
{txt}                     Iscriversi~à    Iscriversi~à    Iscriversi~à   
{txt}{hline 68}
{res}Iscriversi all'uni~à                                                {txt}
{txt}Bullizzati almeno ~a{res}        0.924*                                  {txt}
                    {res} {ralign 12:{txt:(}0.031{txt:)}}                                   {txt}
{txt}Essere donna        {res}        2.427***        2.427***        2.402***{txt}
                    {res} {ralign 12:{txt:(}0.074{txt:)}}    {ralign 12:{txt:(}0.074{txt:)}}    {ralign 12:{txt:(}0.074{txt:)}}   {txt}
{txt}Avere la cittadina~a{res}        0.832***        0.832***        0.835***{txt}
                    {res} {ralign 12:{txt:(}0.045{txt:)}}    {ralign 12:{txt:(}0.045{txt:)}}    {ralign 12:{txt:(}0.045{txt:)}}   {txt}
{txt}Essere nati in Ita~a{res}        1.202***        1.201***        1.203***{txt}
                    {res} {ralign 12:{txt:(}0.048{txt:)}}    {ralign 12:{txt:(}0.048{txt:)}}    {ralign 12:{txt:(}0.048{txt:)}}   {txt}
{txt}Bullizzati spesso   {res}                        0.945+                  {txt}
                    {res}                 {ralign 12:{txt:(}0.031{txt:)}}                   {txt}
{txt}Bullizzati sempre   {res}                                        0.721***{txt}
                    {res}                                 {ralign 12:{txt:(}0.041{txt:)}}   {txt}
{txt}{hline 68}
{txt}Observations        {res}        18113           18113           18113   {txt}
{txt}Pseudo R-squared    {res}        0.035           0.035           0.037   {txt}
{txt}{hline 68}
{txt}Exponentiated coefficients; Standard errors in parentheses
{txt}+ p<0.10, * p<0.05, ** p<0.01, *** p<0.001

{com}. 
. *tutte significative
. 
. 
. *creo global "vissuto"
. global vissuto "donna nato_ita cittadinanza"
{txt}
{com}. 
. 
. ***MODELLI CON VAR RELATIVE ALLA SEZIONE "CONOSCENZA ED USO DELLA LINGUA ITALIANA"
. 
. *bullizzato almeno una volta
. quietly logit studiare bullying parlarebene, or r 
{txt}
{com}. quietly logit studiare bullying parlarebene scriverebene, or r 
{txt}
{com}. quietly logit studiare bullying parlarebene scriverebene pensa_ita,   or r 
{txt}
{com}. estimates store mod4
{txt}
{com}. * nel secondo modello bullying e  parlare bene italiano sembrerebbero essere non significative
. 
. *bullizzato spesso
. quietly logit studiare bullying_often parlarebene, or r 
{txt}
{com}. quietly logit studiare bullying_often parlarebene scriverebene, or r 
{txt}
{com}. quietly logit studiare bullying_often parlarebene scriverebene pensa_ita, or r 
{txt}
{com}. estimates store mod5
{txt}
{com}. *situazione analoga ai 3 modelli precendenti, nel secondo la var bullying_often e parlare bene italiano non sono significative
. *tuttavia qui la var bullying_often non lo è in nessun caso dal momento che si rilevano pvaluea piuttosto alti
. 
. *bullizzato sempre
. quietly logit studiare bullying_everyday parlarebene, or r 
{txt}
{com}. quietly logit studiare bullying_everyday parlarebene scriverebene, or r 
{txt}
{com}. quietly logit studiare bullying_everyday parlarebene scriverebene pensa_ita, or r 
{txt}
{com}. estimates store mod6
{txt}
{com}. 
. 
. tab parlarebene lavorare, chi2

{txt}parlareben {c |}       lavorare
         e {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}     1,900      1,506 {txt}{c |}{res}     3,406 
{txt}         1 {c |}{res}     8,785      5,922 {txt}{c |}{res}    14,707 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}    10,685      7,428 {txt}{c |}{res}    18,113 

{txt}          Pearson chi2({res}1{txt}) = {res} 17.8323  {txt} Pr = {res}0.000
{txt}
{com}. 
. *rinomino le tre var esaminate
. label var parlarebene "Parlare fluentemente italiano"
{txt}
{com}. label var scriverebene "Scrivere italiano correttamente"
{txt}
{com}. label var pensa_ita "Pensare in italiano"
{txt}
{com}. 
. 
. *tutte significative, solo nel secondo modello parlarebene non lo è 
. 
. esttab mod4 mod5 mod6,b(%9.3f) se(%9.3f) eform pr2 label nogaps order() star(+ 0.10 * 0.05 ** 0.01 *** 0.001) title("Essere vittime di bullismo e iscriversi all'università. Modelli Logit con variabili relative alle competenze linguistiche. 1=Bullizzati almeno una volta; 2=Bullizzati spesso; 3=Bullizzati sempre")
{res}
{txt}Essere vittime di bullismo e iscriversi all'università. Modelli Logit con variabili relative alle competenze linguistiche. 1=Bullizzati almeno una volta; 2=Bullizzati spesso; 3=Bullizzati sempre
{txt}{hline 68}
{txt}                              (1)             (2)             (3)   
{txt}                     Iscriversi~à    Iscriversi~à    Iscriversi~à   
{txt}{hline 68}
{res}Iscriversi all'uni~à                                                {txt}
{txt}Bullizzati almeno ~a{res}        0.950                                   {txt}
                    {res} {ralign 12:{txt:(}0.031{txt:)}}                                   {txt}
{txt}Parlare fluentemen~o{res}        0.858*          0.858*          0.856*  {txt}
                    {res} {ralign 12:{txt:(}0.052{txt:)}}    {ralign 12:{txt:(}0.052{txt:)}}    {ralign 12:{txt:(}0.052{txt:)}}   {txt}
{txt}Scrivere italiano ~e{res}        1.392***        1.394***        1.381***{txt}
                    {res} {ralign 12:{txt:(}0.076{txt:)}}    {ralign 12:{txt:(}0.076{txt:)}}    {ralign 12:{txt:(}0.076{txt:)}}   {txt}
{txt}Pensare in italiano {res}        1.287***        1.287***        1.285***{txt}
                    {res} {ralign 12:{txt:(}0.044{txt:)}}    {ralign 12:{txt:(}0.044{txt:)}}    {ralign 12:{txt:(}0.044{txt:)}}   {txt}
{txt}Bullizzati spesso   {res}                        0.976                   {txt}
                    {res}                 {ralign 12:{txt:(}0.032{txt:)}}                   {txt}
{txt}Bullizzati sempre   {res}                                        0.685***{txt}
                    {res}                                 {ralign 12:{txt:(}0.038{txt:)}}   {txt}
{txt}{hline 68}
{txt}Observations        {res}        18113           18113           18113   {txt}
{txt}Pseudo R-squared    {res}        0.006           0.006           0.008   {txt}
{txt}{hline 68}
{txt}Exponentiated coefficients; Standard errors in parentheses
{txt}+ p<0.10, * p<0.05, ** p<0.01, *** p<0.001

{com}. 
. *creo global "lingua_ita"
. global lingua_ita "parlarebene scriverebene pensa_ita"
{txt}
{com}. 
. 
. ***MODELLI CON VAR RELATIVE ALLA SEZIONE "LA SCUOLA, GLI INSEGNANTI E I COMPAGNI"
. 
. 
. *bullizzato almeno una volta
. quietly logit studiare bullying rend_perc_male , or r 
{txt}
{com}. quietly logit studiare bullying rend_perc_male mate_insuf , or r 
{txt}
{com}. quietly logit studiare bullying rend_perc_male mate_insuf ita_male , or r 
{txt}
{com}. quietly logit studiare bullying rend_perc_male mate_insuf ita_male bocciato, or r 
{txt}
{com}. quietly logit studiare bullying rend_perc_male mate_insuf ita_male bocciato aiuto_compiti, or r 
{txt}
{com}. quietly logit studiare bullying rend_perc_male mate_insuf ita_male bocciato aiuto_compiti esce_con_compagni , or r 
{txt}
{com}. quietly logit studiare bullying rend_perc_male mate_insuf ita_male bocciato aiuto_compiti esce_con_compagni lavoretti_frequenti, or r 
{txt}
{com}. quietly logit studiare bullying rend_perc_male mate_insuf ita_male bocciato aiuto_compiti esce_con_compagni lavoretti_frequenti crede_raccomandati, or r 
{txt}
{com}. quietly logit studiare bullying rend_perc_male mate_insuf ita_male bocciato aiuto_compiti esce_con_compagni lavoretti_frequenti crede_raccomandati inizio_scuola_tardi, or r
{txt}
{com}. estimates store mod7
{txt}
{com}. *tutte significative tranne bullying
. 
. *bullizzato spesso
. quietly logit studiare bullying_often rend_perc_male , or r 
{txt}
{com}. quietly logit studiare bullying_often rend_perc_male mate_insuf , or r 
{txt}
{com}. quietly logit studiare bullying_often rend_perc_male mate_insuf ita_male , or r 
{txt}
{com}. quietly logit studiare bullying_often rend_perc_male mate_insuf ita_male bocciato, or r 
{txt}
{com}. quietly logit studiare bullying_often rend_perc_male mate_insuf ita_male bocciato aiuto_compiti, or r 
{txt}
{com}. quietly logit studiare bullying_often rend_perc_male mate_insuf ita_male bocciato aiuto_compiti esce_con_compagni , or r 
{txt}
{com}. quietly logit studiare bullying_often rend_perc_male mate_insuf ita_male bocciato aiuto_compiti esce_con_compagni lavoretti_frequenti, or r 
{txt}
{com}. quietly logit studiare bullying_often rend_perc_male mate_insuf ita_male bocciato aiuto_compiti esce_con_compagni lavoretti_frequenti crede_raccomandati, or r 
{txt}
{com}. quietly logit studiare bullying_often rend_perc_male mate_insuf ita_male bocciato aiuto_compiti esce_con_compagni lavoretti_frequenti crede_raccomandati inizio_scuola_tardi, or r
{txt}
{com}. estimates store mod8
{txt}
{com}. 
. *anche qua tutte significative tranne bullying
. 
. *bullizzato sempre
. quietly logit studiare bullying_everyday rend_perc_male , or r 
{txt}
{com}. quietly logit studiare bullying_everyday rend_perc_male mate_insuf , or r 
{txt}
{com}. quietly logit studiare bullying_everyday rend_perc_male mate_insuf ita_male , or r 
{txt}
{com}. quietly logit studiare bullying_everyday rend_perc_male mate_insuf ita_male bocciato, or r 
{txt}
{com}. quietly logit studiare bullying_everyday rend_perc_male mate_insuf ita_male bocciato aiuto_compiti, or r 
{txt}
{com}. quietly logit studiare bullying_everyday rend_perc_male mate_insuf ita_male bocciato aiuto_compiti esce_con_compagni , or r 
{txt}
{com}. quietly logit studiare bullying_everyday rend_perc_male mate_insuf ita_male bocciato aiuto_compiti esce_con_compagni lavoretti_frequenti, or r 
{txt}
{com}. quietly logit studiare bullying_everyday rend_perc_male mate_insuf ita_male bocciato aiuto_compiti esce_con_compagni lavoretti_frequenti crede_raccomandati, or r 
{txt}
{com}. quietly logit studiare bullying_everyday rend_perc_male mate_insuf ita_male bocciato aiuto_compiti esce_con_compagni lavoretti_frequenti crede_raccomandati inizio_scuola_tardi, or r
{txt}
{com}. estimates store mod9
{txt}
{com}. *tutte significative
. label var rend_perc_male "Rendimento percepito"
{txt}
{com}. label var mate_insuf "Insufficiente in matematica"
{txt}
{com}. label var ita_male "Insufficiente in italiano"
{txt}
{com}. label var bocciato "Bocciato almeno una volta"
{txt}
{com}. label var aiuto_compiti "Doposcuola"
{txt}
{com}. label var esce_con_compagni "Frequenta i compagni di scuola nel tempo libero"
{txt}
{com}. label var lavoretti_frequenti "Svolge spesso lavoretti"
{txt}
{com}. label var crede_raccomandati "Crede che solo i raccomandati vadano avanti"
{txt}
{com}. label var inizio_scuola_tardi "Ha iniziato la scuola in Italia dopo la quinta elementare"
{txt}
{com}. 
. 
. esttab mod7 mod8 mod9,b(%9.3f) se(%9.3f) eform pr2 label nogaps order() star(+ 0.10 * 0.05 ** 0.01 *** 0.001) title("Essere vittime di bullismo e iscriversi all'università. Modelli Logit con variabili relative al contesto scolastico. 1=Bullizzati almeno una volta; 2=Bullizzati spesso; 3=Bullizzati sempre")
{res}
{txt}Essere vittime di bullismo e iscriversi all'università. Modelli Logit con variabili relative al contesto scolastico. 1=Bullizzati almeno una volta; 2=Bullizzati spesso; 3=Bullizzati sempre
{txt}{hline 68}
{txt}                              (1)             (2)             (3)   
{txt}                     Iscriversi~à    Iscriversi~à    Iscriversi~à   
{txt}{hline 68}
{res}Iscriversi all'uni~à                                                {txt}
{txt}Bullizzati almeno ~a{res}        1.030                                   {txt}
                    {res} {ralign 12:{txt:(}0.035{txt:)}}                                   {txt}
{txt}Rendimento percepito{res}        0.606***        0.606***        0.612***{txt}
                    {res} {ralign 12:{txt:(}0.043{txt:)}}    {ralign 12:{txt:(}0.043{txt:)}}    {ralign 12:{txt:(}0.043{txt:)}}   {txt}
{txt}Insufficiente in m~a{res}        0.661***        0.661***        0.664***{txt}
                    {res} {ralign 12:{txt:(}0.029{txt:)}}    {ralign 12:{txt:(}0.029{txt:)}}    {ralign 12:{txt:(}0.029{txt:)}}   {txt}
{txt}Insufficiente in i~o{res}        0.693***        0.693***        0.694***{txt}
                    {res} {ralign 12:{txt:(}0.025{txt:)}}    {ralign 12:{txt:(}0.025{txt:)}}    {ralign 12:{txt:(}0.025{txt:)}}   {txt}
{txt}Bocciato almeno un~a{res}        0.516***        0.516***        0.516***{txt}
                    {res} {ralign 12:{txt:(}0.018{txt:)}}    {ralign 12:{txt:(}0.018{txt:)}}    {ralign 12:{txt:(}0.018{txt:)}}   {txt}
{txt}Doposcuola          {res}        0.715***        0.715***        0.719***{txt}
                    {res} {ralign 12:{txt:(}0.030{txt:)}}    {ralign 12:{txt:(}0.030{txt:)}}    {ralign 12:{txt:(}0.030{txt:)}}   {txt}
{txt}Frequenta i compag~n{res}        1.499***        1.500***        1.488***{txt}
                    {res} {ralign 12:{txt:(}0.057{txt:)}}    {ralign 12:{txt:(}0.057{txt:)}}    {ralign 12:{txt:(}0.056{txt:)}}   {txt}
{txt}Svolge spesso lavo~i{res}        0.676***        0.676***        0.680***{txt}
                    {res} {ralign 12:{txt:(}0.028{txt:)}}    {ralign 12:{txt:(}0.028{txt:)}}    {ralign 12:{txt:(}0.028{txt:)}}   {txt}
{txt}Crede che solo i r~a{res}        1.433***        1.434***        1.426***{txt}
                    {res} {ralign 12:{txt:(}0.047{txt:)}}    {ralign 12:{txt:(}0.047{txt:)}}    {ralign 12:{txt:(}0.046{txt:)}}   {txt}
{txt}Ha iniziato la scu~ {res}        0.903**         0.903**         0.904** {txt}
                    {res} {ralign 12:{txt:(}0.035{txt:)}}    {ralign 12:{txt:(}0.035{txt:)}}    {ralign 12:{txt:(}0.035{txt:)}}   {txt}
{txt}Bullizzati spesso   {res}                        1.043                   {txt}
                    {res}                 {ralign 12:{txt:(}0.036{txt:)}}                   {txt}
{txt}Bullizzati sempre   {res}                                        0.872*  {txt}
                    {res}                                 {ralign 12:{txt:(}0.051{txt:)}}   {txt}
{txt}{hline 68}
{txt}Observations        {res}        18113           18113           18113   {txt}
{txt}Pseudo R-squared    {res}        0.062           0.062           0.063   {txt}
{txt}{hline 68}
{txt}Exponentiated coefficients; Standard errors in parentheses
{txt}+ p<0.10, * p<0.05, ** p<0.01, *** p<0.001

{com}. 
. *creo global "scuola"
. 
. global scuola "rend_perc_male mate_insuf ita_male bocciato aiuto_compiti esce_con_compagni lavoretti_frequenti crede_raccomandati inizio_scuola_tardi"
{txt}
{com}. 
. 
. **MODELLI CON VAR RELATIVE ALLA SEZIONE "IL TEMPO LIBERO E GLI AMICI"
. 
. *var indipendenti
. tab amici_italiani esce_poco, chi2

{txt}amici_ital {c |}       esce_poco
      iani {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}        16          4 {txt}{c |}{res}        20 
{txt}         1 {c |}{res}    15,594      2,499 {txt}{c |}{res}    18,093 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}    15,610      2,503 {txt}{c |}{res}    18,113 

{txt}          Pearson chi2({res}1{txt}) = {res}  0.6424  {txt} Pr = {res}0.423
{txt}
{com}. 
. 
. *bullizzato almeno una volta
. quietly logit studiare bullying uso_molto_internet , or r 
{txt}
{com}. quietly logit studiare bullying uso_molto_internet sport , or r 
{txt}
{com}. quietly logit studiare bullying uso_molto_internet sport amici_italiani , or r 
{txt}
{com}. quietly logit studiare bullying uso_molto_internet sport amici_italiani esce_poco, or r 
{txt}
{com}. estimates store mod10
{txt}
{com}. *avere amici italiani sembrerebbe non essere significativo
. 
. *bullizzato spesso
. quietly logit studiare bullying_often uso_molto_internet , or r 
{txt}
{com}. quietly logit studiare bullying_often uso_molto_internet sport , or r 
{txt}
{com}. quietly logit studiare bullying_often uso_molto_internet sport amici_italiani , or r 
{txt}
{com}. quietly logit studiare bullying_often uso_molto_internet sport amici_italiani esce_poco, or r 
{txt}
{com}. estimates store mod11
{txt}
{com}. *bullying_often e amici italiani non sign
. 
. *bullizzato sempre
. quietly logit studiare bullying_everyday uso_molto_internet , or r 
{txt}
{com}. quietly logit studiare bullying_everyday uso_molto_internet sport , or r 
{txt}
{com}. quietly logit studiare bullying_everyday uso_molto_internet sport amici_italiani , or r 
{txt}
{com}. quietly logit studiare bullying_everyday uso_molto_internet sport amici_italiani esce_poco, or r 
{txt}
{com}. estimates store mod12
{txt}
{com}. *avere amici italiani è non significativo
. label var uso_molto_internet "Naviga molto su internet"
{txt}
{com}. label var sport "Pratica sport"
{txt}
{com}. label var amici_italiani "Avere amici italiani"
{txt}
{com}. label var esce_poco "Esce poco con gli amici"
{txt}
{com}. 
. 
. esttab mod10 mod11 mod12,b(%9.3f) se(%9.3f) eform pr2 label nogaps order() star(+ 0.10 * 0.05 ** 0.01 *** 0.001) title("Essere vittime di bullismo e iscriversi all'università. Modelli Logit con variabili relative alla sfera sociale. 1=Bullizzati almeno una volta; 2=Bullizzati spesso; 3=Bullizzati sempre")
{res}
{txt}Essere vittime di bullismo e iscriversi all'università. Modelli Logit con variabili relative alla sfera sociale. 1=Bullizzati almeno una volta; 2=Bullizzati spesso; 3=Bullizzati sempre
{txt}{hline 68}
{txt}                              (1)             (2)             (3)   
{txt}                     Iscriversi~à    Iscriversi~à    Iscriversi~à   
{txt}{hline 68}
{res}Iscriversi all'uni~à                                                {txt}
{txt}Bullizzati almeno ~a{res}        0.921*                                  {txt}
                    {res} {ralign 12:{txt:(}0.030{txt:)}}                                   {txt}
{txt}Naviga molto su in~t{res}        1.202***        1.198***        1.213***{txt}
                    {res} {ralign 12:{txt:(}0.061{txt:)}}    {ralign 12:{txt:(}0.061{txt:)}}    {ralign 12:{txt:(}0.062{txt:)}}   {txt}
{txt}Pratica sport       {res}        1.072*          1.071*          1.078*  {txt}
                    {res} {ralign 12:{txt:(}0.032{txt:)}}    {ralign 12:{txt:(}0.032{txt:)}}    {ralign 12:{txt:(}0.032{txt:)}}   {txt}
{txt}Avere amici italiani{res}        0.651           0.656           0.597   {txt}
                    {res} {ralign 12:{txt:(}0.297{txt:)}}    {ralign 12:{txt:(}0.298{txt:)}}    {ralign 12:{txt:(}0.269{txt:)}}   {txt}
{txt}Esce poco con gli ~i{res}        1.397***        1.393***        1.417***{txt}
                    {res} {ralign 12:{txt:(}0.061{txt:)}}    {ralign 12:{txt:(}0.061{txt:)}}    {ralign 12:{txt:(}0.062{txt:)}}   {txt}
{txt}Bullizzati spesso   {res}                        0.951                   {txt}
                    {res}                 {ralign 12:{txt:(}0.031{txt:)}}                   {txt}
{txt}Bullizzati sempre   {res}                                        0.644***{txt}
                    {res}                                 {ralign 12:{txt:(}0.035{txt:)}}   {txt}
{txt}{hline 68}
{txt}Observations        {res}        18113           18113           18113   {txt}
{txt}Pseudo R-squared    {res}        0.003           0.003           0.005   {txt}
{txt}{hline 68}
{txt}Exponentiated coefficients; Standard errors in parentheses
{txt}+ p<0.10, * p<0.05, ** p<0.01, *** p<0.001

{com}. 
. *bullying_everyday sign mentre amici_italiani ancora non sign
. 
. *creo global "tempo_libero"
. global tempo_libero " uso_molto_internet sport esce_poco amici_italiani"
{txt}
{com}. 
. ***MODELLI CON VAR RELATIVE ALLA SEZIONE "I TUOI GENITORI E LA TUA FAMIGLIA"
. 
. *var dipendenti, tengo solo vive con madre
. tab vive_con_gen vive_solo_con_madre, chi2

{txt}vive_con_g {c |}  vive_solo_con_madre
        en {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}     4,356        800 {txt}{c |}{res}     5,156 
{txt}         1 {c |}{res}    12,957          0 {txt}{c |}{res}    12,957 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}    17,313        800 {txt}{c |}{res}    18,113 

{txt}          Pearson chi2({res}1{txt}) = {res} 2.1e+03  {txt} Pr = {res}0.000
{txt}
{com}. 
. 
. *bullizzato almeno una volta 
. quietly logit studiare bullying infl_gen_amicizie, or r 
{txt}
{com}. quietly logit studiare bullying infl_gen_amicizie , or r 
{txt}
{com}. quietly logit studiare bullying infl_gen_amicizie vive_solo_con_madre, or r 
{txt}
{com}. quietly logit studiare bullying infl_gen_amicizie vive_solo_con_madre , or r 
{txt}
{com}. quietly logit studiare bullying infl_gen_amicizie vive_solo_con_madre  frat_sor, or r 
{txt}
{com}. quietly logit studiare bullying infl_gen_amicizie vive_solo_con_madre  frat_sor gen_lav, or r
{txt}
{com}. quietly logit studiare bullying infl_gen_amicizie vive_solo_con_madre  frat_sor gen_lav istr_bassa_mad , or r
{txt}
{com}. quietly logit studiare bullying infl_gen_amicizie vive_solo_con_madre  frat_sor gen_lav istr_bassa_mad istr_bassa_pad, or r
{txt}
{com}. quietly logit studiare bullying infl_gen_amicizie vive_solo_con_madre  frat_sor gen_lav istr_bassa_mad istr_bassa_pad  confronto_con_famiglia, or r
{txt}
{com}. estimates store mod13
{txt}
{com}. *bullying e vivere solo con la madre non significative
. 
. *bullizzato spesso
. quietly logit studiare bullying_often infl_gen_amicizie, or r 
{txt}
{com}. quietly logit studiare bullying_often infl_gen_amicizie , or r 
{txt}
{com}. quietly logit studiare bullying_often infl_gen_amicizie vive_solo_con_madre, or r 
{txt}
{com}. quietly logit studiare bullying_often infl_gen_amicizie vive_solo_con_madre , or r 
{txt}
{com}. quietly logit studiare bullying_often infl_gen_amicizie vive_solo_con_madre  frat_sor, or r 
{txt}
{com}. quietly logit studiare bullying_often infl_gen_amicizie vive_solo_con_madre  frat_sor gen_lav, or r
{txt}
{com}. quietly logit studiare bullying_often infl_gen_amicizie vive_solo_con_madre  frat_sor gen_lav istr_bassa_mad , or r
{txt}
{com}. quietly logit studiare bullying_often infl_gen_amicizie vive_solo_con_madre  frat_sor gen_lav istr_bassa_mad istr_bassa_pad, or r
{txt}
{com}. quietly logit studiare bullying_often infl_gen_amicizie vive_solo_con_madre  frat_sor gen_lav istr_bassa_mad istr_bassa_pad  confronto_con_famiglia, or r
{txt}
{com}. estimates store mod14
{txt}
{com}. *bullying_often e vivere solo con madre non significative
. 
. *bullizzato sempre 
. quietly logit studiare bullying_everyday infl_gen_amicizie, or r 
{txt}
{com}. quietly logit studiare bullying_everyday infl_gen_amicizie , or r 
{txt}
{com}. quietly logit studiare bullying_everyday infl_gen_amicizie vive_solo_con_madre, or r 
{txt}
{com}. quietly logit studiare bullying_everyday infl_gen_amicizie vive_solo_con_madre , or r 
{txt}
{com}. quietly logit studiare bullying_everyday infl_gen_amicizie vive_solo_con_madre  frat_sor, or r 
{txt}
{com}. quietly logit studiare bullying_everyday infl_gen_amicizie vive_solo_con_madre  frat_sor gen_lav, or r
{txt}
{com}. quietly logit studiare bullying_everyday infl_gen_amicizie vive_solo_con_madre  frat_sor gen_lav istr_bassa_mad , or r
{txt}
{com}. quietly logit studiare bullying_everyday infl_gen_amicizie vive_solo_con_madre  frat_sor gen_lav istr_bassa_mad istr_bassa_pad, or r
{txt}
{com}. quietly logit studiare bullying_everyday infl_gen_amicizie vive_solo_con_madre  frat_sor gen_lav istr_bassa_mad istr_bassa_pad  confronto_con_famiglia, or r
{txt}
{com}. estimates store mod15
{txt}
{com}. *vivere solo con la madre è non significativa
. label var infl_gen_amicizie "I genitori influenzano le sue amicizie"
{txt}
{com}. label var vive_solo_con_madre "Vive solo con la madre"
{txt}
{com}. label var frat_sor "Ha fratelli e/o sorelle"
{txt}
{com}. label var gen_lav "Almeno un genitore lavora"
{txt}
{com}. label var istr_bassa_mad "La madre ha un'istruzione bassa"
{txt}
{com}. label var istr_bassa_pad "Il padre ha un'istruzione bassa"
{txt}
{com}. label var confronto_con_famiglia "Si confronta spesso con la sua famiglia"
{txt}
{com}. 
. esttab mod13 mod14 mod15,b(%9.3f) se(%9.3f) eform pr2 label nogaps order() star(+ 0.10 * 0.05 ** 0.01 *** 0.001) title("Essere vittime di bullismo e iscriversi all'università. Modelli Logit con variabili relative alla sfera familiare. 1=Bullizzati almeno una volta; 2=Bullizzati spesso; 3=Bullizzati sempre")
{res}
{txt}Essere vittime di bullismo e iscriversi all'università. Modelli Logit con variabili relative alla sfera familiare. 1=Bullizzati almeno una volta; 2=Bullizzati spesso; 3=Bullizzati sempre
{txt}{hline 68}
{txt}                              (1)             (2)             (3)   
{txt}                     Iscriversi~à    Iscriversi~à    Iscriversi~à   
{txt}{hline 68}
{res}Iscriversi all'uni~à                                                {txt}
{txt}Bullizzati almeno ~a{res}        0.955                                   {txt}
                    {res} {ralign 12:{txt:(}0.032{txt:)}}                                   {txt}
{txt}I genitori influen~m{res}        1.058+          1.054+          1.062+  {txt}
                    {res} {ralign 12:{txt:(}0.034{txt:)}}    {ralign 12:{txt:(}0.034{txt:)}}    {ralign 12:{txt:(}0.034{txt:)}}   {txt}
{txt}Vive solo con la m~e{res}        1.063           1.062           1.060   {txt}
                    {res} {ralign 12:{txt:(}0.082{txt:)}}    {ralign 12:{txt:(}0.082{txt:)}}    {ralign 12:{txt:(}0.082{txt:)}}   {txt}
{txt}Ha fratelli e/o so~e{res}        0.922*          0.922*          0.922*  {txt}
                    {res} {ralign 12:{txt:(}0.038{txt:)}}    {ralign 12:{txt:(}0.038{txt:)}}    {ralign 12:{txt:(}0.038{txt:)}}   {txt}
{txt}Almeno un genitore~a{res}        1.162*          1.162*          1.150*  {txt}
                    {res} {ralign 12:{txt:(}0.077{txt:)}}    {ralign 12:{txt:(}0.077{txt:)}}    {ralign 12:{txt:(}0.077{txt:)}}   {txt}
{txt}La madre ha un'ist~a{res}        0.582***        0.582***        0.584***{txt}
                    {res} {ralign 12:{txt:(}0.020{txt:)}}    {ralign 12:{txt:(}0.020{txt:)}}    {ralign 12:{txt:(}0.020{txt:)}}   {txt}
{txt}Il padre ha un'ist~a{res}        0.646***        0.646***        0.649***{txt}
                    {res} {ralign 12:{txt:(}0.022{txt:)}}    {ralign 12:{txt:(}0.022{txt:)}}    {ralign 12:{txt:(}0.022{txt:)}}   {txt}
{txt}Si confronta spess~f{res}        1.300***        1.301***        1.304***{txt}
                    {res} {ralign 12:{txt:(}0.065{txt:)}}    {ralign 12:{txt:(}0.065{txt:)}}    {ralign 12:{txt:(}0.065{txt:)}}   {txt}
{txt}Bullizzati spesso   {res}                        0.979                   {txt}
                    {res}                 {ralign 12:{txt:(}0.033{txt:)}}                   {txt}
{txt}Bullizzati sempre   {res}                                        0.715***{txt}
                    {res}                                 {ralign 12:{txt:(}0.040{txt:)}}   {txt}
{txt}{hline 68}
{txt}Observations        {res}        18113           18113           18113   {txt}
{txt}Pseudo R-squared    {res}        0.033           0.033           0.035   {txt}
{txt}{hline 68}
{txt}Exponentiated coefficients; Standard errors in parentheses
{txt}+ p<0.10, * p<0.05, ** p<0.01, *** p<0.001

{com}. 
. *creo global "famiglia"
. global famiglia " infl_gen_amicizie vive_solo_con_madre frat_sor gen_lav istr_bassa_mad istr_bassa_pad confronto_con_famiglia"
{txt}
{com}. 
. 
. ****MODELLI CON VAR RELATIVE ALLA SEZIONE "LA CASA E LA ZONA IN CUI VIVI"
. 
. 
. *bullizzato almeno una volta
. quietly logit studiare bullying scuola_lontana , or r 
{txt}
{com}. quietly logit studiare bullying scuola_lontana cameretta, or r 
{txt}
{com}. quietly logit studiare bullying scuola_lontana cameretta extr_pov, or r 
{txt}
{com}. quietly logit studiare bullying scuola_lontana cameretta extr_pov pc rural, or r 
{txt}
{com}. estimates store mod16
{txt}
{com}. *avere una cameretta tutta per sè e bullying sembranno non essere significative
. 
. *tutte significative tranne bullying
. 
. *bullizzato spesso
. quietly logit studiare bullying_often scuola_lontana , or r 
{txt}
{com}. quietly logit studiare bullying_often scuola_lontana cameretta, or r 
{txt}
{com}. quietly logit studiare bullying_often scuola_lontana cameretta extr_pov, or r 
{txt}
{com}. quietly logit studiare bullying_often scuola_lontana cameretta extr_pov pc rural, or r 
{txt}
{com}. estimates store mod17
{txt}
{com}. *situazione analoga ai modelli precedenti
. 
. *bullizzato sempre
. quietly logit studiare bullying_everyday scuola_lontana , or r 
{txt}
{com}. quietly logit studiare bullying_everyday scuola_lontana cameretta, or r 
{txt}
{com}. quietly logit studiare bullying_everyday scuola_lontana cameretta extr_pov, or r 
{txt}
{com}. quietly logit studiare bullying_everyday scuola_lontana cameretta extr_pov pc, or r 
{txt}
{com}. quietly logit studiare bullying_everyday scuola_lontana cameretta extr_pov pc rural, or r 
{txt}
{com}. estimates store mod18
{txt}
{com}. *tutte significative
. label var scuola_lontana "viaggia per più di 30 min con un mezzo per raggiungere la scuola"
{txt}
{com}. label var cameretta "ha una camera propria"
{txt}
{com}. label var extr_pov "povertà estrema"
{txt}
{com}. label var pc "La famiglia possiede un pc"
{txt}
{com}. label var rural "Vive in periferia"
{txt}
{com}. 
. 
. esttab mod16 mod17 mod18,b(%9.3f) se(%9.3f) eform pr2 label nogaps order() star(+ 0.10 * 0.05 ** 0.01 *** 0.001) title("Essere vittime di bullismo e iscriversi all'università. Modelli Logit con variabili relative alla casa e alla zona in cui vive. 1=Bullizzati almeno una volta; 2=Bullizzati spesso; 3=Bullizzati sempre")
{res}
{txt}Essere vittime di bullismo e iscriversi all'università. Modelli Logit con variabili relative alla casa e alla zona in cui vive. 1=Bullizzati almeno una volta; 2=Bullizzati spesso; 3=Bullizzati sempre
{txt}{hline 68}
{txt}                              (1)             (2)             (3)   
{txt}                     Iscriversi~à    Iscriversi~à    Iscriversi~à   
{txt}{hline 68}
{res}Iscriversi all'uni~à                                                {txt}
{txt}Bullizzati almeno ~a{res}        0.952                                   {txt}
                    {res} {ralign 12:{txt:(}0.031{txt:)}}                                   {txt}
{txt}viaggia per più di~n{res}        0.879***        0.878***        0.883***{txt}
                    {res} {ralign 12:{txt:(}0.028{txt:)}}    {ralign 12:{txt:(}0.028{txt:)}}    {ralign 12:{txt:(}0.028{txt:)}}   {txt}
{txt}ha una camera prop~a{res}        1.058+          1.058+          1.057+  {txt}
                    {res} {ralign 12:{txt:(}0.032{txt:)}}    {ralign 12:{txt:(}0.032{txt:)}}    {ralign 12:{txt:(}0.032{txt:)}}   {txt}
{txt}povertà estrema    {res}        0.792***        0.790***        0.808***{txt}
                    {res} {ralign 12:{txt:(}0.048{txt:)}}    {ralign 12:{txt:(}0.048{txt:)}}    {ralign 12:{txt:(}0.049{txt:)}}   {txt}
{txt}La famiglia possie~c{res}        1.755***        1.757***        1.726***{txt}
                    {res} {ralign 12:{txt:(}0.098{txt:)}}    {ralign 12:{txt:(}0.098{txt:)}}    {ralign 12:{txt:(}0.096{txt:)}}   {txt}
{txt}Vive in periferia   {res}        0.799***        0.799***        0.800***{txt}
                    {res} {ralign 12:{txt:(}0.026{txt:)}}    {ralign 12:{txt:(}0.026{txt:)}}    {ralign 12:{txt:(}0.026{txt:)}}   {txt}
{txt}Bullizzati spesso   {res}                        0.977                   {txt}
                    {res}                 {ralign 12:{txt:(}0.032{txt:)}}                   {txt}
{txt}Bullizzati sempre   {res}                                        0.704***{txt}
                    {res}                                 {ralign 12:{txt:(}0.039{txt:)}}   {txt}
{txt}{hline 68}
{txt}Observations        {res}        18113           18113           18113   {txt}
{txt}Pseudo R-squared    {res}        0.008           0.008           0.010   {txt}
{txt}{hline 68}
{txt}Exponentiated coefficients; Standard errors in parentheses
{txt}+ p<0.10, * p<0.05, ** p<0.01, *** p<0.001

{com}. 
. 
. *global "abitazione"
. global abitazione "scuola_lontana cameretta extr_pov pc rural"
{txt}
{com}. 
. 
. *ROBUSTNESS CHECKS
. 
. *usiamo una var discreta che trattiamo come continua
. *ricodifichiamo le modalità
. gen amo_fare_compiti=0 
{txt}
{com}. replace amo_fare_compiti=1 if c14_b_2=="5"
{txt}(2,079 real changes made)

{com}. replace amo_fare_compiti=2 if c14_b_2=="4"
{txt}(3,119 real changes made)

{com}. replace amo_fare_compiti=3 if c14_b_2=="3"
{txt}(5,861 real changes made)

{com}. replace amo_fare_compiti=4 if c14_b_2=="2"
{txt}(5,250 real changes made)

{com}. replace amo_fare_compiti=5 if c14_b_2=="1"
{txt}(1,804 real changes made)

{com}. 
. quietly reg amo_fare_compiti bullying_everyday $vissuto, r
{txt}
{com}. estimates store mod19
{txt}
{com}. quietly reg amo_fare_compiti bullying_everyday $lingua_ita, r
{txt}
{com}. estimates store mod20
{txt}
{com}. quietly reg amo_fare_compiti bullying_everyday $scuola, r
{txt}
{com}. estimates store mod21
{txt}
{com}. quietly reg amo_fare_compiti bullying_everyday $tempo_libero, r
{txt}
{com}. estimates store mod22
{txt}
{com}. quietly reg amo_fare_compiti bullying_everyday $famiglia, r
{txt}
{com}. estimates store mod23
{txt}
{com}. quietly reg amo_fare_compiti bullying_everyday $abitazione, r
{txt}
{com}. estimates store mod24
{txt}
{com}. esttab mod19 mod20 mod21 mod22 mod23 mod24,b(%9.3f) se(%9.3f) r2 label nogaps order() star(+ 0.10 * 0.05 ** 0.01 *** 0.001) title("Passione verso lo studio. Modelli Lineari. 1=Vissuto; 2=Padronanza Italiano; 3=Scuola; 4=Tempo Libero; 5=Famiglia; 6=Abitazione e zona in cui vive")
{res}
{txt}Passione verso lo studio. Modelli Lineari. 1=Vissuto; 2=Padronanza Italiano; 3=Scuola; 4=Tempo Libero; 5=Famiglia; 6=Abitazione e zona in cui vive
{txt}{hline 116}
{txt}                              (1)             (2)             (3)             (4)             (5)             (6)   
{txt}                     amo_fare_c~i    amo_fare_c~i    amo_fare_c~i    amo_fare_c~i    amo_fare_c~i    amo_fare_c~i   
{txt}{hline 116}
{txt}Bullizzati sempre   {res}       -0.098**        -0.122***       -0.036          -0.144***       -0.131***       -0.161***{txt}
                    {res} {ralign 12:{txt:(}0.034{txt:)}}    {ralign 12:{txt:(}0.035{txt:)}}    {ralign 12:{txt:(}0.034{txt:)}}    {ralign 12:{txt:(}0.035{txt:)}}    {ralign 12:{txt:(}0.035{txt:)}}    {ralign 12:{txt:(}0.034{txt:)}}   {txt}
{txt}Essere donna        {res}        0.292***                                                                                {txt}
                    {res} {ralign 12:{txt:(}0.017{txt:)}}                                                                                   {txt}
{txt}Essere nati in Ita~a{res}       -0.286***                                                                                {txt}
                    {res} {ralign 12:{txt:(}0.022{txt:)}}                                                                                   {txt}
{txt}Avere la cittadina~a{res}       -0.266***                                                                                {txt}
                    {res} {ralign 12:{txt:(}0.030{txt:)}}                                                                                   {txt}
{txt}Parlare fluentemen~o{res}                        0.180***                                                                {txt}
                    {res}                 {ralign 12:{txt:(}0.035{txt:)}}                                                                   {txt}
{txt}Scrivere italiano ~e{res}                        0.213***                                                                {txt}
                    {res}                 {ralign 12:{txt:(}0.031{txt:)}}                                                                   {txt}
{txt}Pensare in italiano {res}                       -0.133***                                                                {txt}
                    {res}                 {ralign 12:{txt:(}0.020{txt:)}}                                                                   {txt}
{txt}Rendimento percepito{res}                                       -0.717***                                                {txt}
                    {res}                                 {ralign 12:{txt:(}0.034{txt:)}}                                                   {txt}
{txt}Insufficiente in m~a{res}                                       -0.087***                                                {txt}
                    {res}                                 {ralign 12:{txt:(}0.022{txt:)}}                                                   {txt}
{txt}Insufficiente in i~o{res}                                       -0.151***                                                {txt}
                    {res}                                 {ralign 12:{txt:(}0.018{txt:)}}                                                   {txt}
{txt}Bocciato almeno un~a{res}                                       -0.148***                                                {txt}
                    {res}                                 {ralign 12:{txt:(}0.018{txt:)}}                                                   {txt}
{txt}Doposcuola          {res}                                       -0.042+                                                  {txt}
                    {res}                                 {ralign 12:{txt:(}0.023{txt:)}}                                                   {txt}
{txt}Frequenta i compag~n{res}                                        0.022                                                   {txt}
                    {res}                                 {ralign 12:{txt:(}0.020{txt:)}}                                                   {txt}
{txt}Svolge spesso lavo~i{res}                                        0.050*                                                  {txt}
                    {res}                                 {ralign 12:{txt:(}0.022{txt:)}}                                                   {txt}
{txt}Crede che solo i r~a{res}                                        0.339***                                                {txt}
                    {res}                                 {ralign 12:{txt:(}0.017{txt:)}}                                                   {txt}
{txt}Ha iniziato la scu~ {res}                                        0.497***                                                {txt}
                    {res}                                 {ralign 12:{txt:(}0.020{txt:)}}                                                   {txt}
{txt}Naviga molto su in~t{res}                                                       -0.158***                                {txt}
                    {res}                                                 {ralign 12:{txt:(}0.028{txt:)}}                                   {txt}
{txt}Pratica sport       {res}                                                       -0.062***                                {txt}
                    {res}                                                 {ralign 12:{txt:(}0.017{txt:)}}                                   {txt}
{txt}Esce poco con gli ~i{res}                                                        0.166***                                {txt}
                    {res}                                                 {ralign 12:{txt:(}0.025{txt:)}}                                   {txt}
{txt}Avere amici italiani{res}                                                        0.150                                   {txt}
                    {res}                                                 {ralign 12:{txt:(}0.272{txt:)}}                                   {txt}
{txt}I genitori influen~m{res}                                                                       -0.070***                {txt}
                    {res}                                                                 {ralign 12:{txt:(}0.018{txt:)}}                   {txt}
{txt}Vive solo con la m~e{res}                                                                       -0.024                   {txt}
                    {res}                                                                 {ralign 12:{txt:(}0.043{txt:)}}                   {txt}
{txt}Ha fratelli e/o so~e{res}                                                                       -0.009                   {txt}
                    {res}                                                                 {ralign 12:{txt:(}0.023{txt:)}}                   {txt}
{txt}Almeno un genitore~a{res}                                                                       -0.210***                {txt}
                    {res}                                                                 {ralign 12:{txt:(}0.038{txt:)}}                   {txt}
{txt}La madre ha un'ist~a{res}                                                                        0.009                   {txt}
                    {res}                                                                 {ralign 12:{txt:(}0.019{txt:)}}                   {txt}
{txt}Il padre ha un'ist~a{res}                                                                       -0.116***                {txt}
                    {res}                                                                 {ralign 12:{txt:(}0.019{txt:)}}                   {txt}
{txt}Si confronta spess~f{res}                                                                       -0.137***                {txt}
                    {res}                                                                 {ralign 12:{txt:(}0.025{txt:)}}                   {txt}
{txt}viaggia per più di~n{res}                                                                                       -0.084***{txt}
                    {res}                                                                                 {ralign 12:{txt:(}0.018{txt:)}}   {txt}
{txt}ha una camera prop~a{res}                                                                                       -0.066***{txt}
                    {res}                                                                                 {ralign 12:{txt:(}0.017{txt:)}}   {txt}
{txt}povertà estrema    {res}                                                                                        0.295***{txt}
                    {res}                                                                                 {ralign 12:{txt:(}0.034{txt:)}}   {txt}
{txt}La famiglia possie~c{res}                                                                                       -0.016   {txt}
                    {res}                                                                                 {ralign 12:{txt:(}0.031{txt:)}}   {txt}
{txt}Vive in periferia   {res}                                                                                        0.098***{txt}
                    {res}                                                                                 {ralign 12:{txt:(}0.018{txt:)}}   {txt}
{txt}Constant            {res}        3.054***        2.865***        3.003***        3.099***        3.507***        3.089***{txt}
                    {res} {ralign 12:{txt:(}0.014{txt:)}}    {ralign 12:{txt:(}0.021{txt:)}}    {ralign 12:{txt:(}0.022{txt:)}}    {ralign 12:{txt:(}0.273{txt:)}}    {ralign 12:{txt:(}0.048{txt:)}}    {ralign 12:{txt:(}0.034{txt:)}}   {txt}
{txt}{hline 116}
{txt}Observations        {res}        18113           18113           18113           18113           18113           18113   {txt}
{txt}R-squared           {res}        0.046           0.015           0.102           0.007           0.007           0.010   {txt}
{txt}{hline 116}
{txt}Standard errors in parentheses
{txt}+ p<0.10, * p<0.05, ** p<0.01, *** p<0.001

{com}. 
. *la variabile riferita al bullying è sempre e comunque significativa e negativamente associata al grado di apprezzamento dello studio, ci sono dei cambi di segno
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Utente\Desktop\UNI\DEMOGRAFIA APPLICATA ALL'IMPRESA E AL MERCATO\progetto\log_progeto_demo_Pietro_Ruffo.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}23 May 2021, 11:49:48
{txt}{.-}
{smcl}
{txt}{sf}{ul off}